DataProcessors/Канбан_v3.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>Канбан_v3</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОбращенияВПоддержку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОбращенияВПоддержку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрНакопления</xr:Item>
				<xr:Item>InformationRegister.ИсторияИзмененийОбращений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПоступления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРеакцииФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРешенияФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тональность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоНазначениеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РешитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРеакцииРегламент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРешенияРегламент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияСообщений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВремя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/Канбан_v3/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы  

&НаСервере
Функция ПолучитьОбращениеПоНомеру(НомерОбращения)
	Возврат Документы.ОбращенияВПоддержку.НайтиПоНомеру(НомерОбращения);
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуПросмотра(НомерОбращения)  
	СсылкаНаОбращение = ПолучитьОбращениеПоНомеру(НомерОбращения);
    ПараметрыФормы = Новый Структура("ПараметрФормыПросмотра", СсылкаНаОбращение);
    ОткрытьФорму("Обработка.ФормаПросмотраОбращенияОператора2.Форма.ФормаПросмотра",
 			  ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолеHTML = СформироватьИнтерфейсНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеHTMLДокументСформирован(Элемент)
	ПодключитьОбработчикОжидания("ПолучитьИОбработатьДанные", 1, Ложь);	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПолучитьИОбработатьДанные() Экспорт
	ОкноДокумента = ЭтаФорма.Элементы.ПолеHTML.Документ.defaultView;
	Если ОкноДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Пока ОкноДокумента.queueHead < ОкноДокумента.queueTail Цикл //Если есть что-то в очереди
		ДанныеJSON = ОкноДокумента.getEvent(ОкноДокумента.queueHead + 1); 
		Данные = ПрочитатьДанныеИзJSON(ДанныеJSON);
		ОкноДокумента.queueHead = ОкноДокумента.queueHead + 1;
		Если Данные = Неопределено Тогда
			Возврат; 
			
		ИначеЕсли Данные["event"] = "ClickItem" Тогда
			Номер = Данные["itemId"];
			ОткрытьФормуПросмотра(Номер);
		ИначеЕсли Данные["event"] = "DropItem" Тогда
			НомерОбращения = Данные["itemId"];
			ИдентификаторКатегории = Данные["categoryId"];
			ОбновитьСтатусОбращения(НомерОбращения, ИдентификаторКатегории);			
		//ИначеЕсли Данные["event"] = "ClickItem" Тогда
		//	Номер = Данные["itemId"];
		//	ОткрытьФормуПросмотра(Номер);
		КонецЕсли;     
		//Сообщить("Событие: " + ЗаписатьДанныеВJSON(Данные));
	КонецЦикла; 
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьСтатусОбращения(НомерОбращения, ИдентификаторКатегории)
	ВыполнитьОбновлениеСтатусаНаСервере(НомерОбращения, ИдентификаторКатегории);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбновлениеСтатусаНаСервере(НомерОбращения, ИдентификаторКатегории)

	
	// Убедимся, что номер — строка и убраны лишние пробелы
	НомерОбращения = СтрЗаменить(НомерОбращения, " ", "");
	Если НомерОбращения = "" Тогда
		Возврат;
	КонецЕсли;
	
	// Пытаемся найти по номеру
	СсылкаНаОбращение = Документы.ОбращенияВПоддержку.НайтиПоНомеру(НомерОбращения);
	
	// Проверяем НЕ ТОЛЬКО на Неопределено, но и на ПустаяСсылка!
	Если СсылкаНаОбращение = Неопределено Тогда
		// Попробуем найти через запрос, игнорируя ведущие нули
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОбращенияВПоддержку.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОбращенияВПоддержку КАК ОбращенияВПоддержку
		|ГДЕ
		|	(ОбращенияВПоддержку.Номер = &Номер
		|			ИЛИ ОбращенияВПоддержку.Номер = &НомерБезНулей
		|			ИЛИ &НомерБезНулей = ОбращенияВПоддержку.Номер)";
		
		
	
		// Удалим ведущие нули из номера
		ЧисловойНомер = Число(НомерОбращения); // преобразуем в число → уберутся нули
		НомерБезНулей = Формат(ЧисловойНомер, "ЧЦ=0"); // вернём как строку без нулей
		
		Запрос.УстановитьПараметр("Номер", НомерОбращения);
		Запрос.УстановитьПараметр("НомерБезНулей", НомерБезНулей);
		
		Результат = Запрос.Выполнить().Выбрать();
		Если НЕ Результат.Следующий() Тогда
			Возврат; // не найдено
		КонецЕсли;
		
		СсылкаНаОбращение = Результат.Ссылка;
	КонецЕсли;
	
	// Теперь точно есть валидная ссылка
	Обращение = СсылкаНаОбращение.ПолучитьОбъект();
	
	// ... далее сопоставление статуса и запись
	
	НовыйСтатус = Неопределено;
	Выборка = Новый Соответствие;
	Выборка.Вставить("0", Перечисления.СтатусыЗаявок.Новое);
	Выборка.Вставить("1", Перечисления.СтатусыЗаявок.КВыполнению);
	Выборка.Вставить("2", Перечисления.СтатусыЗаявок.ВРаботе);
	Выборка.Вставить("3", Перечисления.СтатусыЗаявок.ВОжидании);
	Выборка.Вставить("4", Перечисления.СтатусыЗаявок.Выполнено);
	
	//Если НЕ Выборка.Свойство(ИдентификаторКатегории) Тогда
	//	Возврат;
	//КонецЕсли;
	
	Обращение.Статус = Выборка[ИдентификаторКатегории];
	Обращение.Записать(РежимЗаписиДокумента.Запись); 
	//Если РежимЗаписиДокумента.Запись Тогда
	//	Обращение.Записать(РежимЗаписиДокумента.Запись); 
	//ИначеЕсли РежимЗаписиДокумента.Проведение Тогда 
	//	Обращение.Записать(РежимЗаписиДокумента.Проведение);  
	//КонецЕсли;
	

		
КонецПроцедуры






&НаСервереБезКонтекста
Функция ПрочитатьДанныеИзJSON(СтрокаJSON)
	Результат = ПрочитатьСтрокуJSON(СтрокаJSON);
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		Возврат ПрочитатьСтрокуJSON(Результат);
	Иначе
		Возврат Результат;
	КонецЕсли; 
КонецФункции

&НаСервереБезКонтекста
Функция ПрочитатьСтрокуJSON(СтрокаJSON) Экспорт
	
	Результат = Неопределено;
	
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ЗаписатьДанныеВJSON(Данные) Экспорт
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON());     
		
		ЗаписатьJSON(ЗаписьJSON, Данные);
		
		Возврат ЗаписьJSON.Закрыть();
	Исключение
	    Сообщить(ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки; 
КонецФункции


#КонецОбласти 

#Область Демо

&НаСервере
Функция СформироватьИнтерфейсНаСервере()

	Шаблон = ПолучитьШаблонHTML();

	Kanban = СформироватьКанбан();
	
	ОбъектКанбан = РеквизитФормыВЗначение("Объект");
	
	css_body = ОбъектКанбан.ПолучитьМакет("css_body").ПолучитьТекст();
	css_kanban_container = ОбъектКанбан.ПолучитьМакет("css_kanban_container").ПолучитьТекст();
	
	css_category = ОбъектКанбан.ПолучитьМакет("css_category").ПолучитьТекст();
	ШиринаКолонки = 270;
	css_category = СтрЗаменить(css_category, "width: 250px", "width: " + ШиринаКолонки + "px");
	
	css_items_container = ОбъектКанбан.ПолучитьМакет("css_items_container").ПолучитьТекст();
	css_item = ОбъектКанбан.ПолучитьМакет("css_item").ПолучитьТекст();
	css_load_button = ОбъектКанбан.ПолучитьМакет("css_load_button").ПолучитьТекст();
	
	CSS = css_body + css_kanban_container + css_category + css_items_container + css_item + css_load_button; 
	
	JS = ОбъектКанбан.ПолучитьМакет("js").ПолучитьТекст();

	Возврат СтрШаблон(Шаблон, CSS, Kanban, JS);
КонецФункции

&НаСервере 
Функция СформироватьКанбан()
	Категории = Новый Массив;
	ШаблонКатегории = ПолучитьШаблонКатегории();
	
	// Явно задаём ID категорий как "0", "1", "2"...
	Категории.Добавить(СтрШаблон(ШаблонКатегории, "0", "Новое", СформироватьЗадачиКатегории_Новое(), СформироватьКнопкуЗагрузки(), "211, 255, 206"));
	Категории.Добавить(СтрШаблон(ШаблонКатегории, "1", "К Выполнению", СформироватьЗадачиКатегории_КВыполнению(), СформироватьКнопкуЗагрузки(), "205, 242, 255"));   
	Категории.Добавить(СтрШаблон(ШаблонКатегории, "2", "В Работе", СформироватьЗадачиКатегории_ВРаботе(), СформироватьКнопкуЗагрузки(), "213, 220, 255"));
	Категории.Добавить(СтрШаблон(ШаблонКатегории, "3", "В Ожидании", СформироватьЗадачиКатегории_ВОжидании(), СформироватьКнопкуЗагрузки(), "255, 230, 213"));
	Категории.Добавить(СтрШаблон(ШаблонКатегории, "4", "Выполнено", СформироватьЗадачиКатегории_Выполнено(), СформироватьКнопкуЗагрузки(), "210, 255, 228"));

	Возврат СтрСоединить(Категории, Символы.ПС + Символы.ВК);
КонецФункции
//Функция СформироватьКанбан()
//	Категории = Новый Массив;
//	
//	ШаблонКатегории = ПолучитьШаблонКатегории();
//	Категории.Добавить(СтрШаблон(ШаблонКатегории, Строка(Новый УникальныйИдентификатор()), "Новое", СформироватьЗадачиКатегории_Новое(), СформироватьКнопкуЗагрузки(), "211, 255, 206"));
//	Категории.Добавить(СтрШаблон(ШаблонКатегории, Строка(Новый УникальныйИдентификатор()), "К Выполнению", СформироватьЗадачиКатегории_КВыполнению(), СформироватьКнопкуЗагрузки(), "205, 242, 255"));   
//	Категории.Добавить(СтрШаблон(ШаблонКатегории, Строка(Новый УникальныйИдентификатор()), "В Работе", СформироватьЗадачиКатегории_ВРаботе(), СформироватьКнопкуЗагрузки(), "213, 220, 255"));
//	Категории.Добавить(СтрШаблон(ШаблонКатегории, Строка(Новый УникальныйИдентификатор()), "В Ожидании", СформироватьЗадачиКатегории_ВОжидании(), СформироватьКнопкуЗагрузки(), "255, 230, 213"));
//	Категории.Добавить(СтрШаблон(ШаблонКатегории, Строка(Новый УникальныйИдентификатор()), "Выполнено", СформироватьЗадачиКатегории_Выполнено(), СформироватьКнопкуЗагрузки(), "210, 255, 228"));

//	
//	Возврат СтрСоединить(Категории, Символы.ПС + Символы.ВК);
//КонецФункции

&НаСервере
Функция СформироватьКнопкуЗагрузки(Вывести = Ложь)
	// Как-то получаем список задач в текущей категории и при необходимости возвращаем шаблон кнопки
	Если Вывести Тогда
		Возврат ПолучитьШаблонКнопкиЗагрузки();
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

&НаСервере
Функция СформироватьЗадачиКатегории_Новое()  
	ЗадачиКатегории = Новый Массив;
	
	ШаблонЭлемента = ПолучитьШаблонЭлемента();
	
	ОператорТекущий = ПолноеИмяПользователя();
	ТекущийПользователь = Справочники.Сотрудники.НайтиПоНаименованию(ОператорТекущий);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбращенияВПоддержку.Номер КАК Номер,
	                      |	ОбращенияВПоддержку.Тема КАК Тема,
	                      |	ОбращенияВПоддержку.Ответственный КАК Ответственный,
	                      |	ОбращенияВПоддержку.Категория КАК Категория,
	                      |	ОбращенияВПоддержку.Приоритет КАК Приоритет,
	                      |	ОбращенияВПоддержку.Статус КАК Статус,
	                      |	ОбращенияВПоддержку.Описание КАК Описание
	                      |ИЗ
	                      |	Документ.ОбращенияВПоддержку КАК ОбращенияВПоддержку
	                      |ГДЕ
	                      |	ОбращенияВПоддержку.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Новое)
	                      |	И ОбращенияВПоддержку.Ответственный = &ТекущийПользователь");
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
	Пока Выборка.Следующий() Цикл                          
		Номер = Выборка.Номер;
		Тема = Выборка.Тема;
		Приоритет = Выборка.Приоритет;
		Ответственный = Выборка.Ответственный;  
		Категория = Выборка.Категория;
		Описание = Выборка.Описание;
		ЗадачиКатегории.Добавить(СтрШаблон(ШаблонЭлемента, Номер, Номер, Тема, Описание, Ответственный, Приоритет, Категория));
    КонецЦикла;
	
	Возврат СтрСоединить(ЗадачиКатегории, Символы.ПС + Символы.ВК);
КонецФункции

&НаСервере
Функция СформироватьЗадачиКатегории_КВыполнению()
	ЗадачиКатегории = Новый Массив;
	
	ШаблонЭлемента = ПолучитьШаблонЭлемента();
	
	ОператорТекущий = ПолноеИмяПользователя();
	ТекущийПользователь = Справочники.Сотрудники.НайтиПоНаименованию(ОператорТекущий);  
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбращенияВПоддержку.Номер КАК Номер,
	                      |	ОбращенияВПоддержку.Тема КАК Тема,
	                      |	ОбращенияВПоддержку.Ответственный КАК Ответственный,
	                      |	ОбращенияВПоддержку.Категория КАК Категория,
	                      |	ОбращенияВПоддержку.Приоритет КАК Приоритет,
	                      |	ОбращенияВПоддержку.Статус КАК Статус,
	                      |	ОбращенияВПоддержку.Описание КАК Описание
	                      |ИЗ
	                      |	Документ.ОбращенияВПоддержку КАК ОбращенияВПоддержку
	                      |ГДЕ
	                      |	ОбращенияВПоддержку.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.КВыполнению)
	                      |	И ОбращенияВПоддержку.Ответственный = &ТекущийПользователь");
	
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
	Пока Выборка.Следующий() Цикл                          
		Номер = Выборка.Номер;
		Тема = Выборка.Тема;
		Приоритет = Выборка.Приоритет;
		Ответственный = Выборка.Ответственный;  
		Категория = Выборка.Категория;
		Описание = Выборка.Описание;
		ЗадачиКатегории.Добавить(СтрШаблон(ШаблонЭлемента, Номер, Номер, Тема, Описание, Ответственный, Приоритет, Категория));
    КонецЦикла;
	
	Возврат СтрСоединить(ЗадачиКатегории, Символы.ПС + Символы.ВК);
КонецФункции   

&НаСервере
Функция СформироватьЗадачиКатегории_ВРаботе()
	ЗадачиКатегории = Новый Массив;
	
	ШаблонЭлемента = ПолучитьШаблонЭлемента(); 
	
	ОператорТекущий = ПолноеИмяПользователя();
	ТекущийПользователь = Справочники.Сотрудники.НайтиПоНаименованию(ОператорТекущий);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбращенияВПоддержку.Номер КАК Номер,
	                      |	ОбращенияВПоддержку.Тема КАК Тема,
	                      |	ОбращенияВПоддержку.Ответственный КАК Ответственный,
	                      |	ОбращенияВПоддержку.Категория КАК Категория,
	                      |	ОбращенияВПоддержку.Приоритет КАК Приоритет,
	                      |	ОбращенияВПоддержку.Статус КАК Статус,
	                      |	ОбращенияВПоддержку.Описание КАК Описание
	                      |ИЗ
	                      |	Документ.ОбращенияВПоддержку КАК ОбращенияВПоддержку
	                      |ГДЕ
	                      |	ОбращенияВПоддержку.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.ВРаботе)
	                      |	И ОбращенияВПоддержку.Ответственный = &ТекущийПользователь");
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
	Пока Выборка.Следующий() Цикл                          
		Номер = Выборка.Номер;
		Тема = Выборка.Тема;
		Приоритет = Выборка.Приоритет;
		Ответственный = Выборка.Ответственный;  
		Категория = Выборка.Категория;
		Описание = Выборка.Описание;
		ЗадачиКатегории.Добавить(СтрШаблон(ШаблонЭлемента, Номер, Номер, Тема, Описание, Ответственный, Приоритет, Категория));
    КонецЦикла;
	
	Возврат СтрСоединить(ЗадачиКатегории, Символы.ПС + Символы.ВК);
КонецФункции  

&НаСервере
Функция СформироватьЗадачиКатегории_ВОжидании()
	ЗадачиКатегории = Новый Массив;
	
	ШаблонЭлемента = ПолучитьШаблонЭлемента();   
	
	ОператорТекущий = ПолноеИмяПользователя();
	ТекущийПользователь = Справочники.Сотрудники.НайтиПоНаименованию(ОператорТекущий);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбращенияВПоддержку.Номер КАК Номер,
	                      |	ОбращенияВПоддержку.Тема КАК Тема,
	                      |	ОбращенияВПоддержку.Ответственный КАК Ответственный,
	                      |	ОбращенияВПоддержку.Категория КАК Категория,
	                      |	ОбращенияВПоддержку.Приоритет КАК Приоритет,
	                      |	ОбращенияВПоддержку.Статус КАК Статус,
	                      |	ОбращенияВПоддержку.Описание КАК Описание
	                      |ИЗ
	                      |	Документ.ОбращенияВПоддержку КАК ОбращенияВПоддержку
	                      |ГДЕ
	                      |	ОбращенияВПоддержку.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.ВОжидании)
	                      |	И ОбращенияВПоддержку.Ответственный = &ТекущийПользователь");
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
	Пока Выборка.Следующий() Цикл                          
		Номер = Выборка.Номер;
		Тема = Выборка.Тема;
		Приоритет = Выборка.Приоритет;
		Ответственный = Выборка.Ответственный;  
		Категория = Выборка.Категория;
		Описание = Выборка.Описание;
		ЗадачиКатегории.Добавить(СтрШаблон(ШаблонЭлемента, Номер, Номер, Тема, Описание, Ответственный, Приоритет, Категория));
    КонецЦикла;
	
	Возврат СтрСоединить(ЗадачиКатегории, Символы.ПС + Символы.ВК);
КонецФункции  

&НаСервере
Функция СформироватьЗадачиКатегории_Выполнено()
	ЗадачиКатегории = Новый Массив;
	
	ШаблонЭлемента = ПолучитьШаблонЭлемента(); 
	
	ОператорТекущий = ПолноеИмяПользователя();
	ТекущийПользователь = Справочники.Сотрудники.НайтиПоНаименованию(ОператорТекущий);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбращенияВПоддержку.Номер КАК Номер,
	                      |	ОбращенияВПоддержку.Тема КАК Тема,
	                      |	ОбращенияВПоддержку.Ответственный КАК Ответственный,
	                      |	ОбращенияВПоддержку.Категория КАК Категория,
	                      |	ОбращенияВПоддержку.Приоритет КАК Приоритет,
	                      |	ОбращенияВПоддержку.Статус КАК Статус,
	                      |	ОбращенияВПоддержку.Описание КАК Описание
	                      |ИЗ
	                      |	Документ.ОбращенияВПоддержку КАК ОбращенияВПоддержку
	                      |ГДЕ
	                      |	ОбращенияВПоддержку.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Выполнено)
	                      |	И ОбращенияВПоддержку.Ответственный = &ТекущийПользователь");
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
	Пока Выборка.Следующий() Цикл                          
		Номер = Выборка.Номер;
		Тема = Выборка.Тема;
		Приоритет = Выборка.Приоритет;
		Ответственный = Выборка.Ответственный;  
		Категория = Выборка.Категория;
		Описание = Выборка.Описание;
		ЗадачиКатегории.Добавить(СтрШаблон(ШаблонЭлемента, Номер, Номер, Тема, Описание, Ответственный, Приоритет, Категория));
    КонецЦикла;
	
	Возврат СтрСоединить(ЗадачиКатегории, Символы.ПС + Символы.ВК);
КонецФункции  

#КонецОбласти 

#Область HTML

Функция ПолучитьШаблонHTML() Экспорт
	
	ШаблонHTML = "
	|<!DOCTYPE html>
	|<html lang=""ru"">
	|<head>
	|  <meta charset=""UTF-8"">
	|  <meta name=""viewport"" content=""width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no, minimal-ui"">
	|  <title>Kanban Board</title>
	|  <style>
	|    %1
	|  </style>
	|</head>
	|<body>
	|
	|<div class=""kanban-container"">
	|%2
	|</div>
	|
	|%3
	|
	|</body>
	|</html>";
	
	Возврат ШаблонHTML;
КонецФункции                                                                                                                 

Функция ПолучитьШаблонКатегории() Экспорт
	
	ШаблонHTML = "
	|<div class=""category"" data-category-id=""%1"" ondragover=""event.preventDefault()"" ondrop=""onDrop(event)"" style=""background:rgba(%5, 0.5);"">
	|  <div class=""category-header"">
    |    <h3>%2</h3>
    |  </div>
	|  <div class=""items-container"">
	|    %3
	|    %4
	|  </div>
	|</div>";
	
	Возврат ШаблонHTML;
КонецФункции




Функция ПолучитьШаблонЭлемента() Экспорт
	ШаблонHTML = "
       |<div class=""item"" 
       |     draggable=""true"" 
       |     data-id=""%1""
       |     ondragstart=""onDragStart(event)"" 
       |     ondragend=""onDragEnd(event)"" 
       |     onclick=""onClickItem('%1')"" 
       |     style=""display: block;"">                                             
       |<div class=""item-number""><font size=""2"">%2</font></div>                                               
       |<div class=""""><b><font size=""4"">%3</font></b></div>
       |<p class="""">%4</p>
       |<p class=""item-problem-responsible""><i>%5</i></p> 
       |<div class=""item-priority-details""> 
       |<div class=""item-priority"">%6</div>	
       |<div class=""item-problem-category"">%7</div>
       |</div></div>";
	
	Возврат ШаблонHTML;
КонецФункции





//Функция ПолучитьШаблонЭлемента() Экспорт
//	
//	ШаблонHTML = "
//       |<div class=""item"" draggable=""true"" ondragstart=""onDragStart(event)"" ondragend=""onDragEnd(event)"" onclick=""onClickItem('%1')"" style=""display: block;"">                                             
//       |<div class=""item-number""><font size=""2"">%2</font></div>                                               
//       |<div class=""""><b><font size=""4"">%3</font></b></div>
//       |<p class="""">%4</p>
//       |<p class=""item-problem-responsible""><i>%5</i></p> 
//       |<div class=""item-priority-details""> 
//       |<div class=""item-priority"">%6</div>	
//       |<div class=""item-problem-category"">%7</div>
//       |</div></div>";
//	
//	Возврат ШаблонHTML;
//КонецФункции

Функция ПолучитьШаблонКнопкиЗагрузки() Экспорт
	
	ШаблонHTML = "<button class=""load-more-button"" onclick=""onLoadMoreClick(this)"">Загрузить еще</button>";
	
	Возврат ШаблонHTML;
КонецФункции

#КонецОбласти
